#include <stdio.h>

int main()
{
    printf("10진수 5에서 18까지 8진수로 표현\n");
    printf("10진수 5 -----> 8진수 5 : 0005\n");
    printf("10진수 6 -----> 8진수 5 : 0006\n");
    printf("10진수 7 -----> 8진수 7 : 0007\n");
    printf("10진수 8 -----> 8진수 8 : 0010\n");
    printf("10진수 9 -----> 8진수 9 : 0011\n");
    printf("10진수 10 -----> 8진수 10 : 0012\n");
    printf("10진수 11 -----> 8진수 11 : 0013\n");
    printf("10진수 12 -----> 8진수 12 : 0014\n");
    printf("10진수 13 -----> 8진수 13 : 0015\n");
    printf("10진수 14 -----> 8진수 14 : 0016\n");
    printf("10진수 15 -----> 8진수 15 : 0017\n");
    printf("10진수 16 -----> 8진수 16 : 0020\n");    
    printf("10진수 17 -----> 8진수 17 : 0021\n");
    printf("10진수 18 -----> 8진수 18 : 0022\n");

    return 0;
}