#include <stdio.h>

int main()
{
    printf("10진수 8~20까지 2진수 표현 ---> 16진수 표현\n");
    printf("10진수 8 ----> 2진수 8: 1000 ---> 16진수 8: 0008\n");
    printf("10진수 9 ----> 2진수 9: 1001 ---> 16진수 8: 0009\n");
    printf("10진수 10----> 2진수 10: 1010 ---> 16진수 8: 000A\n");
    printf("10진수 11 ----> 2진수 11: 1011 ---> 16진수 8: 000B\n");
    printf("10진수 12 ----> 2진수 12: 1100 ---> 16진수 8: 000C\n");
    printf("10진수 13 ----> 2진수 13: 1101 ---> 16진수 8: 000D\n");
    printf("10진수 14 ----> 2진수 14: 1110 ---> 16진수 8: 000E\n");
    printf("10진수 15 ----> 2진수 15: 1111 ---> 16진수 8: 000F\n");
    printf("10진수 16 ----> 2진수 16: 0001 0000 ---> 16진수 8: 0010\n");
    printf("10진수 17 ----> 2진수 17: 0001 0001 ---> 16진수 8: 0011\n");
    printf("10진수 18 ----> 2진수 18: 0001 0010 ---> 16진수 8: 0012\n");
    printf("10진수 19 ----> 2진수 19: 0001 0011 ---> 16진수 8: 0013\n");
    printf("10진수 20 ----> 2진수 20: 0001 0100 ---> 16진수 8: 0004\n");

    return 0;
}